{
  "backend/main.mo": "Main Motoko actor defining the backend CMS with game details, user profiles, admin initialization/reset, password protection, and content management endpoints, using a mixin-based access control system.",
  "feature_evidence.json": "Feature evidence report describing two implemented features on AdminDashboard.tsx: auto-claiming admin on first login and a 'Reset Admin Access' button for the access-denied screen.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering pages, components, hooks, and styling for the press kit CMS application.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH-based CSS custom properties defining a monochrome light/dark design token system for backgrounds, foregrounds, borders, and sidebar colors.",
  "frontend/index.html": "HTML entry point titled 'Poke A Nose — Press Kit' that loads Fredoka One and Inter fonts from Google Fonts and mounts the React app at the root div.",
  "frontend/src/App.tsx": "Root React app that sets up TanStack Router with four routes, ThemeContext and EditModeContext providers, a profile setup modal for new admins, and applies the body text color CSS variable from the backend.",
  "frontend/src/components/AdminSidebar.tsx": "Left sidebar navigation component for the admin dashboard with Content, Media, Social, and Settings links, highlighting the active section and navigating to the settings route.",
  "frontend/src/components/CMSContentEditor.tsx": "A CMS editor component that renders different admin sections (content, media, social) with forms for editing game title, tagline, about text, features, game details, and social links using React Query mutations.",
  "frontend/src/components/CMSFieldEditor.tsx": "A reusable form field component for the CMS that supports single-line and multiline inputs with dirty-state tracking, save/saving/saved status indicators, and an async onSave callback.",
  "frontend/src/components/EditableFeaturesList.tsx": "A list component that renders game features as read-only bullets or as editable inputs with add/remove controls and an async save action when in editing mode.",
  "frontend/src/components/Header.tsx": "A minimal fixed header component that renders a single dark/light theme toggle button in the top-right corner.",
  "frontend/src/components/InlineEditableField.tsx": "An inline text field that toggles between a display span and an editable input, supporting click-to-edit, Enter/Escape key handling, and an async onSave callback.",
  "frontend/src/components/PasswordModal.tsx": "A centered modal form that prompts the user for a password to access the press kit, calling an async onVerify callback and displaying errors on failure.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useEditMode.ts": "Provides a React context and hooks for managing a global edit-mode boolean state with toggle and set helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, exposing identity, login/clear functions, and login status to the React component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for reading and mutating backend data (admin status, user profile, game content, theme settings, etc.) via the ICP actor.",
  "frontend/src/hooks/useTheme.ts": "Custom hook that manages light/dark theme state, persists it to localStorage, and toggles the 'dark' class on the document root.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light/dark themes, typography, background image, scrollbar, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that handles Internet Identity authentication, auto-initializes or resets the admin slot, and renders the CMS content editor with a sidebar.",
  "frontend/src/pages/LandingPage.tsx": "Landing page displaying the game logo, about text, and a CTA button linking to the press kit, with dark mode background inversion support.",
  "frontend/src/pages/PressKitPage.tsx": "Press kit page showing editable game details, screenshots, video, and social links, with optional password protection and inline CMS editing support.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page with sections for enabling/disabling password protection on the press kit and selecting a body text color theme via grayscale swatches. Requires authenticated admin identity; redirects unauthorized users to home.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers to maintain values like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a monochrome editorial design system with oklch CSS variable-based colors, Fredoka One and Inter fonts, zero border-radius, and custom fade/accordion keyframe animations.",
  "project_state.json": "Project state snapshot (version 19) describing a black-and-white ICP-hosted game press kit with Internet Identity auth, admin CMS, password-protected press kit, and known issues including admin login failure and YouTube URL not updating."
}