{
  "backend/main.mo": "Main Motoko actor implementing the game press kit CMS backend with admin initialization, access control, user profiles, and CMS content management (game details, text, social links, password protection).",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: adding 1px borders to press kit screenshot images and rewriting the Header component to fix the Internet Identity login button.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing their purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Global CSS file defining OKLCH-based design tokens for light and dark modes using CSS custom properties, with Tailwind base/components/utilities layers.",
  "frontend/index.html": "HTML entry point for the React app, loading Fredoka One and Inter fonts from Google Fonts and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with four routes, ThemeContext, EditModeContext, body text color application, and a profile setup modal for new admins.",
  "frontend/src/components/AdminSidebar.tsx": "Left sidebar navigation component for the admin dashboard with links to Content, Media, Social, and Settings sections, highlighting the active section.",
  "frontend/src/components/CMSContentEditor.tsx": "A CMS editor component that renders different admin sections (content, media, social) and provides forms for editing game title, tagline, about text, features, game details, and social links using React Query mutations.",
  "frontend/src/components/CMSFieldEditor.tsx": "A reusable form field component for the CMS that supports single-line and multiline inputs with dirty-state tracking, save/saving/saved status indicators, and an async onSave callback.",
  "frontend/src/components/EditableFeaturesList.tsx": "A component that renders a list of game features either as a read-only bullet list or as an editable list of inputs with add/remove controls and an async save action.",
  "frontend/src/components/Header.tsx": "A fixed top-right header component that provides a theme toggle button and a sign-in button using Internet Identity, showing a loading spinner during authentication.",
  "frontend/src/components/InlineEditableField.tsx": "An inline text field component that toggles between display and edit modes, supporting keyboard shortcuts (Enter/Escape), async save with error rollback, and an optional always-edit mode.",
  "frontend/src/components/PasswordModal.tsx": "A modal form component that prompts the user for a password to access a protected press kit, calling an async onVerify callback and displaying errors on failure.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using an authenticated identity when available or falling back to an anonymous actor, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useEditMode.ts": "Provides a React context and hooks for managing a global edit mode toggle state, including context creation, a consumer hook, and a state initializer hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login status, identity persistence, and delegation validity across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for reading and mutating backend data (admin status, user profile, game content, social links, password, etc.) via the canister actor.",
  "frontend/src/hooks/useTheme.ts": "Custom hook that manages light/dark theme state, persists the preference to localStorage, and toggles the 'dark' class on the document root.",
  "frontend/src/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light/dark color tokens, typography, background image, scrollbar, and utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that handles Internet Identity login, auto-initializes or resets the admin principal, and renders the CMS sidebar and content editor for authenticated admins.",
  "frontend/src/pages/LandingPage.tsx": "Landing page displaying the game logo, a short description fetched from the backend, and a CTA button linking to the press kit.",
  "frontend/src/pages/PressKitPage.tsx": "Press kit page that displays and inline-edits game content (title, tagline, features, details, links), supports password protection, and includes a screenshot gallery and video modal.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page with sections for enabling/disabling/updating password protection on the press kit and selecting a body text color theme via grayscale swatches. Requires authenticated admin identity; redirects unauthorized users to home.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a monochrome editorial design system with oklch CSS-variable-based color tokens, zero border-radius, Fredoka One and Inter font families, and accordion/fade keyframe animations.",
  "project_state.json": "Project state snapshot (version 29) describing the black-and-white ICP-hosted game press kit app's architecture, existing features, and known issues such as deployment failures and admin access problems."
}