{
  "backend/main.mo": "Main Motoko actor implementing the game press kit CMS backend with access control, user profiles, and content management (game details, text, links, password protection). Exposes public query and update functions for admin initialization, content editing, and user profile management.",
  "backend/migration.mo": "Migration module that resets the access control state to fresh on upgrade while preserving all other CMS content fields (game details, text, links, user profiles).",
  "feature_evidence.json": "Feature evidence report documenting two implemented requirements: updating the YouTube embed URL with specific query parameters, and closing the fullscreen screenshot overlay by clicking the image itself with event propagation stopped.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's frontend components, pages, hooks, and configuration.",
  "frontend/index.css": "Global CSS file defining Tailwind base styles and a monochrome OKLCH design token system with light and dark mode CSS custom properties for colors, borders, and sidebar theming.",
  "frontend/index.html": "HTML entry point that loads Fredoka One and Inter fonts from Google Fonts, sets the page title to 'Poke A Nose — Press Kit', and mounts the React app at the root div.",
  "frontend/src/App.tsx": "Main React app file that sets up TanStack Router with four routes, provides ThemeContext and EditModeContext, applies body text color from the backend, and shows a profile setup modal for new admins.",
  "frontend/src/components/AdminSidebar.tsx": "Left sidebar navigation component for the admin dashboard with links to Content, Media, Social, and Settings sections, highlighting the active section and navigating to the settings route.",
  "frontend/src/components/CMSContentEditor.tsx": "A CMS editor component that renders different admin sections (content, media, social) with inline editing for game title, tagline, about text, features, game details, and social links using React Query mutations.",
  "frontend/src/components/CMSFieldEditor.tsx": "A reusable form field editor component supporting single-line and multiline inputs with dirty-state tracking, save/loading/saved status indicators, and an async onSave callback.",
  "frontend/src/components/EditableFeaturesList.tsx": "A list component that renders game features as read-only bullets or as editable inputs with add/remove controls and a save button when in editing mode.",
  "frontend/src/components/Header.tsx": "A sticky site header with logo navigation, theme toggle, Internet Identity auth button, and admin-only edit mode toggle and settings link.",
  "frontend/src/components/InlineEditableField.tsx": "An inline text field that displays as plain text normally and switches to an input with save/cancel keyboard handling when edit mode is active.",
  "frontend/src/components/PasswordModal.tsx": "A centered modal form that prompts for a password to access the press kit, calling an async onVerify callback and displaying errors on failure.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor, initializing access control with an admin token and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useEditMode.ts": "Defines a React context and hooks for managing a global edit-mode boolean state with toggle and set helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status via an AuthClient wrapper.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for reading and mutating backend canister data, including user profiles, game content fields, social links, and password protection settings.",
  "frontend/src/hooks/useTheme.ts": "Custom hook that manages light/dark theme state, persists the preference to localStorage, and toggles the 'dark' class on the document root.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light/dark color themes, typography, background image handling, scrollbar styles, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that guards access by checking authentication and admin status, then renders a sidebar and CMS content editor for managing site sections.",
  "frontend/src/pages/LandingPage.tsx": "Landing page displaying the game logo, about text, a newsletter signup form, and a call-to-action button linking to the press kit.",
  "frontend/src/pages/PressKitPage.tsx": "Press kit page that displays editable game info, screenshots, a video modal, and social/contact links, with optional password protection before content is shown.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page with sections for enabling/disabling password protection on the press kit and selecting a body text color theme via grayscale swatches. Requires authenticated admin identity; redirects unauthorized users to home.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a monochrome editorial design system with OKLCH CSS-variable-based color tokens, Fredoka One and Inter fonts, zero border-radius, and custom fade/accordion keyframe animations.",
  "project_state.json": "Project state snapshot describing the black-and-white ICP-hosted game press kit app's architecture, existing features, known issues, and versioned feature list for build planning."
}