{
  "backend/main.mo": "Main Motoko actor defining the backend CMS with game details, user profiles, admin access control, password protection, and content fields (title, tagline, about, features, social links).",
  "feature_evidence.json": "Feature evidence report confirming that the newsletter signup and 'Welcome to our game' heading were removed from LandingPage.tsx, keeping only the logo, CMS description, and CTA button.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's frontend structure.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH-based monochrome design tokens for light and dark themes, including sidebar and chart color variables.",
  "frontend/index.html": "HTML entry point titled 'Poke A Nose — Press Kit' that loads Fredoka One and Inter fonts from Google Fonts and mounts the React app.",
  "frontend/src/App.tsx": "Root React app setting up TanStack Router with four routes, ThemeContext, EditModeContext, body text color application, and a profile setup modal for new admins.",
  "frontend/src/components/AdminSidebar.tsx": "Fixed left sidebar for the admin dashboard with navigation buttons for Content, Media, Social, and Settings sections, navigating to the settings route directly.",
  "frontend/src/components/CMSContentEditor.tsx": "Section-based CMS editor component rendering Content, Media, or Social editors with field-level save handlers and a features list with add/remove/edit controls.",
  "frontend/src/components/CMSFieldEditor.tsx": "A reusable form field component (single-line or multiline) with save/saving/saved state management, used for editing CMS content fields inline.",
  "frontend/src/components/EditableFeaturesList.tsx": "A list editor component that renders game features as a read-only bullet list or an editable input list (up to 4 items) with add, remove, and save functionality.",
  "frontend/src/components/Header.tsx": "A minimal fixed header component that renders a single light/dark theme toggle button in the top-right corner.",
  "frontend/src/components/InlineEditableField.tsx": "An inline text field that toggles between a display span and an editable input, supporting click-to-edit, Enter/Escape key handling, and async save with revert on error.",
  "frontend/src/components/PasswordModal.tsx": "A centered modal form that prompts the user for a password to access the press kit, showing loading and error states while delegating verification to a parent-provided callback.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing admin access control when an identity is present and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useEditMode.ts": "Provides a React context and hooks for managing a global edit mode toggle state, with both a context consumer hook and a state initializer hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, exposing identity, login/clear functions, and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query read queries and mutations for backend data (game title, tagline, features, links, colors, etc.), each wired to the actor from useActor.",
  "frontend/src/hooks/useTheme.ts": "A hook that manages light/dark theme state, persisting the preference to localStorage and toggling the 'dark' class on the document root.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, CSS custom properties for light/dark themes, typography (Inter + Fredoka One fonts), background image handling, and utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that checks authentication and admin status, auto-initializes the first admin, and renders the AdminSidebar with CMSContentEditor for managing site content.",
  "frontend/src/pages/LandingPage.tsx": "Landing page displaying the game logo, a dynamic about text fetched from the backend, and a CTA button linking to the press kit.",
  "frontend/src/pages/PressKitPage.tsx": "Press kit page with password protection, inline-editable content fields (tagline, about, features, game details, links), screenshot gallery with fullscreen view, and a YouTube video modal.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page with sections for enabling/disabling press kit password protection and configuring the body text color theme.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Fredoka One, Inter), oklch-based color tokens, zero border-radius, custom shadows, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Project state document (version 15) describing the black-and-white Game Press Kit website's architecture, existing features, known issues, and build plan for an ICP canister backend with Internet Identity auth and a ShadCN-inspired monochrome editorial frontend."
}