{
  "backend/main.mo": "Main Motoko actor implementing the game press kit CMS backend with access control, admin initialization, user profiles, and content management (game details, text, social links, password protection).",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — cross-browser Internet Identity auth fix and AdminDashboard auth flow fix — to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's frontend architecture and component responsibilities.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH-based design token variables for light and dark themes covering background, foreground, card, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point titled 'Poke A Nose — Press Kit' that loads Fredoka One and Inter fonts from Google Fonts and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React app component wiring together TanStack Router (4 routes), QueryClient, next-themes ThemeProvider, a legacy AppThemeContext bridge, EditModeContext, InternetIdentityProvider, and a BodyTextColorApplier.",
  "frontend/src/components/AdminSidebar.tsx": "Fixed left sidebar component for the admin dashboard with navigation buttons for Content, Media, Social, and Settings sections, highlighting the active section.",
  "frontend/src/components/CMSContentEditor.tsx": "A CMS editor component that renders different admin sections (content, media, social) with editable fields for game title, tagline, about text, features, game details, and social links using React Query mutations.",
  "frontend/src/components/CMSFieldEditor.tsx": "A reusable single-field editor component supporting text input or textarea with dirty-state tracking, save/loading/saved status indicators, and an onSave async callback.",
  "frontend/src/components/EditableFeaturesList.tsx": "A list component that renders game features as read-only bullets or as editable inputs with add/remove controls and a save button when in editing mode.",
  "frontend/src/components/Header.tsx": "A fixed top-right header component providing theme toggle (light/dark) and Internet Identity authentication (login/logout) buttons with error handling.",
  "frontend/src/components/InlineEditableField.tsx": "An inline text field that toggles between display and edit mode, supporting save on Enter/blur and cancel on Escape, with a pencil icon trigger when editing is enabled.",
  "frontend/src/components/PasswordModal.tsx": "A modal form that prompts the user for a password to access the press kit, calling an async onVerify callback and displaying errors on failure.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useEditMode.ts": "A React context and hooks for managing a global edit-mode boolean state, exposing toggle and set helpers via context.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching and mutating backend data including content fields, admin status, and password settings via the actor interface.",
  "frontend/src/hooks/useTheme.ts": "Custom hook that manages light/dark theme state, persists the preference to localStorage, and toggles the 'dark' class on the document root.",
  "frontend/src/index.css": "Global stylesheet using Tailwind with CSS custom properties for light/dark theming, typography settings, background image handling, and scrollbar styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that handles Internet Identity login, auto-initializes the admin account if none exists, and renders section-based content editing via a sidebar.",
  "frontend/src/pages/LandingPage.tsx": "Landing page displaying the game logo, a dynamic about text fetched from the backend, and a CTA button navigating to the press kit.",
  "frontend/src/pages/PressKitPage.tsx": "The main press kit page component that displays game info (tagline, about, features, details, screenshots, video) with optional password protection and inline CMS editing support via React Query mutations.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only settings page that provides controls for enabling/disabling password protection on the press kit and selecting the body text color theme via grayscale swatches.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and a function to clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a monochrome editorial design system with custom OKLCH color tokens, Fredoka One/Inter fonts, zero border-radius, and accordion/fade animation keyframes.",
  "project_state.json": "Project state snapshot (version 31) documenting the architecture, existing features, known issues, and build history for a black-and-white ICP-hosted game press kit site with Internet Identity auth and admin CMS."
}