{
  "kind": "build_request",
  "title": "Screenshot 1px border + reliable Internet Identity login in header",
  "projectName": "Poke A Nose Press Kit",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "In the Press Kit screenshots gallery (frontend/src/pages/PressKitPage.tsx), add a 1-pixel solid black border to every screenshot image in the responsive grid. The border must also apply to the image displayed inside the fullscreen overlay. In dark mode, the border should be 1px solid white (to remain visible against the dark background). The border must be applied directly to the <img> elements via Tailwind classes or inline styles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "on the screenshots images make 1 pixel black border around them"
        ]
      },
      "acceptanceCriteria": [
        "Each screenshot thumbnail in the grid has a visible 1px solid black border in light mode",
        "Each screenshot thumbnail in the grid has a visible 1px solid white border in dark mode",
        "The fullscreen overlay image also has the 1px border applied",
        "No other UI elements gain unexpected borders"
      ]
    },
    {
      "id": "REQ-38",
      "text": "Rewrite frontend/src/components/Header.tsx from scratch to definitively fix the Internet Identity login button. The component must: (1) import useInternetIdentity from its canonical path 'frontend/src/hooks/useInternetIdentity'; (2) read isAuthenticated (or equivalent identity/principal state) from the hook synchronously at render time — do not gate the button on any async loading flag that delays its appearance; (3) render a 'Sign In' button in the top-right corner (alongside the dark/light theme toggle) whenever isAuthenticated is false; (4) call the hook's login() function on button click to trigger the Internet Identity authentication popup; (5) hide the 'Sign In' button completely once isAuthenticated is true; (6) style the button in the monochrome editorial style — ghost or outlined, black/white/grayscale only, no color accents. The button must be visible on first page load when the user is not logged in, with no delay or flicker caused by initialization guards.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a working login / sign in to internet computer to verify admin because it is still not there, already tried two times"
        ]
      },
      "acceptanceCriteria": [
        "The 'Sign In' button is visible in the top-right corner on first page load when the user has no active Internet Identity session",
        "Clicking 'Sign In' opens the Internet Identity authentication popup",
        "After successful login, the 'Sign In' button disappears from the header",
        "The button is styled monochromatically (no color accents, black/white/grayscale only)",
        "The button appears on all four routes: /, /press-kit, /admin, /admin/settings",
        "No initialization loading guard delays or prevents the button from rendering when unauthenticated"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths (useInternetIdentity.ts, useActor.ts, main.tsx, components/ui)",
    "Monochrome editorial style must be preserved — no color accents outside #000000, #FFFFFF, and grayscale tones",
    "Do not alter any backend CMS stable variables or logic"
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity",
    "Changing the admin initialization or reset logic",
    "Modifying any other page components beyond Header.tsx and PressKitPage.tsx",
    "Adding borders to any UI elements other than screenshot images"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}