{
  "kind": "build_request",
  "title": "Fix Internet Identity cross-browser compatibility and admin access rejection",
  "projectName": "PokeANose Press Kit",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "Fix the Internet Identity authentication flow in frontend/src/hooks/useInternetIdentity.ts (read-only) and any surrounding integration code so that login works correctly across all major browsers (Chrome, Safari, Edge, Firefox). Audit the AuthClient configuration for known cross-browser issues: ensure the identity provider URL is correctly set for production (using the IC mainnet II canister URL), that popup/redirect handling is compatible with browsers that block third-party popups, and that the delegationIdentity and storage options are set in a browser-agnostic way. If the hook itself cannot be modified (immutable path), create a wrapper or patch the integration layer in useActor.ts or App.tsx to resolve the compatibility gap.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "make sure it works for all browsers currently it is only working on firefox"
        ]
      },
      "acceptanceCriteria": [
        "Internet Identity login popup opens and completes successfully in Chrome, Safari, Edge, and Firefox",
        "After completing II authentication in any browser, the user is recognized as authenticated (isAuthenticated is true)",
        "The Sign In button disappears after successful login in all browsers",
        "No browser-specific errors or silent failures during the authentication flow"
      ]
    },
    {
      "id": "REQ-40",
      "text": "Reset the adminPrincipal stable variable in the Motoko backend (backend/main.mo) to null by ensuring the resetAdmin() public update function correctly sets adminPrincipal to null with no access guard. Verify that after reset, calling initializeAdmin() from a freshly authenticated principal correctly claims the admin slot. Audit the option type comparison logic so that a null adminPrincipal is unambiguously recognized as 'no admin set' and a new principal can claim it without being rejected.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "reset again the token",
          "also rejected again after signin in"
        ]
      },
      "acceptanceCriteria": [
        "resetAdmin() sets adminPrincipal to null with no access restrictions",
        "After resetAdmin() is called, getAdminStatus() returns false",
        "After resetAdmin(), the next authenticated user who calls initializeAdmin() successfully becomes admin",
        "initializeAdmin() does not reject a valid new principal when adminPrincipal is null"
      ]
    },
    {
      "id": "REQ-41",
      "text": "Fix the AdminDashboard page (frontend/src/pages/AdminDashboard.tsx) so that after a successful Internet Identity login, the admin status check and initializeAdmin() auto-claim flow work correctly and the dashboard renders for the newly authenticated admin — without showing 'Access Denied'. Ensure the actor used for getAdminStatus() and initializeAdmin() calls is updated to use the authenticated identity immediately after login completes, so the backend receives the correct authenticated principal and does not reject it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "rejected again after signin in"
        ]
      },
      "acceptanceCriteria": [
        "After Internet Identity login completes on the AdminDashboard, the actor is re-instantiated with the authenticated identity before calling getAdminStatus()",
        "If no admin is set, initializeAdmin() is called with the authenticated identity and the calling principal is stored as admin",
        "The dashboard renders correctly after the admin claim without showing 'Access Denied'",
        "If an admin is already set and the logged-in principal matches, the dashboard renders without requiring a reset"
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "Do not clear or modify any CMS stable variables (aboutText, features, gameDetails, instagramLink, developerLink, pressEmail, bodyTextColor, gameTitle, tagline, passwordEnabled, passwordHash) when resetting the admin principal",
    "All UI changes must remain in the monochrome editorial style (black/white/grayscale only, no color accents)"
  ],
  "nonGoals": [
    "Adding new CMS fields or press kit content sections",
    "Changing the visual design or layout of any page",
    "Modifying the screenshot gallery, video embed, or other press kit features",
    "Supporting non-Internet-Identity authentication methods"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}