{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix YouTube URL and screenshot fullscreen close",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Update YouTube embed URL to C-Q0-2kiFhs with playsinline and fs=0 parameters",
      "acceptanceCriteria": [
        "The iframe embed URL is exactly https://www.youtube.com/embed/C-Q0-2kiFhs?playsinline=1&fs=0&autoplay=1 (or equivalent with those parameters) when the play button is clicked",
        "The old video ID (5in-hIASH08) does not appear anywhere in PressKitPage.tsx",
        "Clicking the thumbnail play button reveals the inline iframe and starts playback",
        "No fullscreen button is shown in the embedded player"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PressKitPage.tsx",
          "operation": "modify",
          "description": "Update the YouTube video ID from '5in-hIASH08' to 'C-Q0-2kiFhs' in the videoId constant. Ensure the iframe src includes query parameters playsinline=1 and fs=0 in addition to autoplay=1. The video thumbnail with play button overlay should remain functional, revealing the inline iframe with the updated URL when clicked."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add click handler to screenshot image in fullscreen overlay to close the overlay",
      "acceptanceCriteria": [
        "Clicking the screenshot image in fullscreen overlay closes the overlay",
        "After closing, the press kit page content is visible and scroll is re-enabled",
        "No previous/next navigation arrows are present in the overlay",
        "Clicking the backdrop (outside the image) also closes the overlay"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PressKitPage.tsx",
          "operation": "modify",
          "description": "Add an onClick handler directly to the <img> element inside the fullscreen screenshot overlay. The handler must call setFullscreenImage(null) and stopPropagation() to prevent the event from bubbling. This ensures clicking the image itself (not just the backdrop) closes the overlay and returns the user to the normal press kit view."
        }
      ]
    }
  ]
}