{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin system: add reset endpoint and correct principal-based admin initialization",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Auto-initialize admin after login if no admin exists, with correct state evaluation",
      "acceptanceCriteria": [
        "After login, getAdminStatus() is called before deciding whether to show dashboard or access denied",
        "If no admin is set, initializeAdmin() is called automatically and the user gains admin access",
        "If admin is already set and matches the logged-in principal, dashboard renders correctly",
        "If admin is already set and does not match, access denied screen is shown",
        "The UI does not get stuck in a loading or stale state after the login + initialize sequence",
        "React Query cache is invalidated or refetched after initializeAdmin() so fresh admin status is used"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Modify the admin authentication flow to call getAdminStatus() after login, then auto-call initializeAdmin() if no admin exists. After initializeAdmin() succeeds, invalidate the React Query cache for admin status and re-query to confirm the user is now admin. Ensure the UI correctly reflects the true state after each async step (login → check status → initialize if empty → re-check → render dashboard or access denied). Use the authorization component's backend capabilities for getAdminStatus() and initializeAdmin(). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Add Reset Admin Access button on access-denied screen with monochrome styling",
      "acceptanceCriteria": [
        "Reset Admin Access button appears on the access denied screen only when the user is authenticated",
        "Clicking the button calls resetAdmin() followed by initializeAdmin()",
        "After successful reset and claim, the dashboard renders for the new admin",
        "Button is styled with monochrome colors only",
        "Loading state is shown while reset/initialize is in progress",
        "Error state is shown if the operation fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a 'Reset Admin Access' button to the access-denied screen that only appears when the user is authenticated. On click, call resetAdmin() from the backend, then immediately call initializeAdmin() to claim admin for the current user. Show loading state during the operation and error state if it fails. After success, invalidate React Query cache and re-render the dashboard. Style the button in monochrome editorial style (black background with white text or outlined ghost style, using only #000000, #FFFFFF, and grayscale tones). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook for the resetAdmin() backend capability. This hook should call actor.resetAdmin(), return the result, and provide loading/error states. Do not include invalidation logic in the hook itself; let the calling component handle cache invalidation after the mutation succeeds."
        }
      ]
    }
  ]
}