{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Screenshot 1px border + reliable Internet Identity login in header",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Add 1px border to screenshot images in press kit gallery with dark mode support",
      "acceptanceCriteria": [
        "Each screenshot thumbnail in the grid has a visible 1px solid black border in light mode",
        "Each screenshot thumbnail in the grid has a visible 1px solid white border in dark mode",
        "The fullscreen overlay image also has the 1px border applied",
        "No other UI elements gain unexpected borders"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PressKitPage.tsx",
          "operation": "modify",
          "description": "Add 1px solid border to all screenshot <img> elements in the responsive grid using Tailwind classes 'border border-black dark:border-white'. Apply the same border classes to the fullscreen overlay <img> element that displays when a screenshot is clicked. Ensure the border is applied directly to the img tags, not to wrapper divs, and verify the border is visible in both light and dark modes without affecting any other UI elements."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Rewrite Header component to show working Internet Identity sign-in button on first render",
      "acceptanceCriteria": [
        "The 'Sign In' button is visible in the top-right corner on first page load when the user has no active Internet Identity session",
        "Clicking 'Sign In' opens the Internet Identity authentication popup",
        "After successful login, the 'Sign In' button disappears from the header",
        "The button is styled monochromatically (no color accents, black/white/grayscale only)",
        "The button appears on all four routes: /, /press-kit, /admin, /admin/settings",
        "No initialization loading guard delays or prevents the button from rendering when unauthenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Completely rewrite the Header component to fix the Internet Identity login button. Import useInternetIdentity from 'frontend/src/hooks/useInternetIdentity' and read the identity field synchronously at render time. Render a 'Sign In' button in the top-right corner (next to the theme toggle) whenever identity is null or undefined—do not gate the button's visibility on loginStatus === 'idle' or any other async loading flag. On button click, call the login() function from the hook to trigger the Internet Identity popup. Hide the 'Sign In' button completely when identity is truthy (user is authenticated). Style the button using monochrome classes only: ghost or outlined style with black text in light mode and white text in dark mode, no color accents. Remove any initialization guards or loginStatus checks that prevent the button from appearing immediately on first page load when the user is unauthenticated. Ensure the button is visible and functional on all routes."
        }
      ]
    }
  ]
}